# TextPosition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting..::..TextPosition Property
OrdinateDimensionSetting Class See Also
---
Specifies the dimension text position.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public OrdinateTextPosition TextPosition { get; set; }
```

Visual Basic
---
```text
Public Property TextPosition As OrdinateTextPosition
	Get
	Set
```

Visual C++
---
```text
public:
property OrdinateTextPosition TextPosition {
	OrdinateTextPosition get ();
	void set (OrdinateTextPosition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace